STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_pmic.c
/**
  ******************************************************************************
  * @file    stm32mp257f_eval_stpmic.c
  * @author  MCD Application Team
  * @brief   stpmu driver functions used for ST internal validation
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ----------------------------------------------------------------------*/
#include "stm32mp257f_eval.h"
#include "stm32mp257f_eval_bus.h"
#include "stm32mp257f_eval_pmic.h"
#include <string.h>
#include <stdio.h>

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP257F_EVAL_STPMU
  * @{
  */


/** @defgroup STM32MP257F_EVAL_STPMU_Private_Constants Private Constants
  * @{
  */
/* Driver for PMIC ---------------------------------------------------------------*/

/* Board Configuration ------------------------------------------------------------*/
/**
  * @}
  */

/** @defgroup STM32MP257F_EVAL_STPMU_Private_Defines Private Defines
  * @{
 */
/* Private typedef -----------------------------------------------------------*/


/* Private define ------------------------------------------------------------*/
#define ARRAY_SIZE(x) (sizeof(x) / sizeof((x)[0]))


/**
  * @}
 */

/** @defgroup STM32MP257F_EVAL_STPMU_Private_Variables Private Variables
  * @{
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* I2C handler declaration */
I2C_HandleTypeDef I2cHandle;
extern I2C_HandleTypeDef hI2c7;

static STPMIC2_Drv_t *Stpmic2Drv = NULL;
static void         *CompObj = NULL;


/*
  Table of EVAL board regulators
*/

board_regul_struct_t board_regulators_table[] =
{
  {
    "VDDCPU",      VDDCPU,      STPMIC_BUCK1,  BUCK1_MAIN_CR1,  BUCK1_MAIN_CR2,  \
    BUCK1_ALT_CR1,  BUCK1_ALT_CR2,  BUCK1_PWRCTRL_CR,  800,  910
  },
  {
    "VDDCORE",     VDDCORE,     STPMIC_BUCK2,  BUCK2_MAIN_CR1,  BUCK2_MAIN_CR2,  \
    BUCK2_ALT_CR1,  BUCK2_ALT_CR2,  BUCK2_PWRCTRL_CR,  820,  820
  },
  {
    "VDDGPU",      VDDGPU,      STPMIC_BUCK3,  BUCK3_MAIN_CR1,  BUCK3_MAIN_CR2,  \
    BUCK3_ALT_CR1,  BUCK3_ALT_CR2,  BUCK3_PWRCTRL_CR,  800,  900
  },
  {
    "VDDIO_PMIC",  VDDIO_PMIC,  STPMIC_BUCK4,  BUCK4_MAIN_CR1,  BUCK4_MAIN_CR2,  \
    BUCK4_ALT_CR1,  BUCK4_ALT_CR2,  BUCK4_PWRCTRL_CR,  3300, 3300
  },
  {
    "VDDA1V8_AON", VDDA1V8_AON, STPMIC_LDO1,   LDO1_MAIN_CR,    LDO1_MAIN_CR,    \
    LDO1_ALT_CR,    LDO1_ALT_CR,    LDO1_PWRCTRL_CR,   1800, 1800
  },
  {
    "VDD_EMMC",    VDD_EMMC,    STPMIC_LDO2,   LDO2_MAIN_CR,    LDO2_MAIN_CR,    \
    LDO2_ALT_CR,    LDO2_ALT_CR,    LDO2_PWRCTRL_CR,   1800, 1800
  },
  {
    "V1V8",        V1V8,        STPMIC_BUCK5,  BUCK5_MAIN_CR1,  BUCK5_MAIN_CR2,  \
    BUCK5_ALT_CR1,  BUCK5_ALT_CR2,  BUCK5_PWRCTRL_CR,  1800, 1800
  },
  {
    "VDD3V3_USB",  VDD3V3_USB,  STPMIC_LDO4,   LDO4_MAIN_CR,    LDO4_MAIN_CR,    \
    LDO4_ALT_CR,    LDO4_ALT_CR,    LDO4_PWRCTRL_CR,   3300, 3300
  },
  {
    "VDD_DDR",     VDD_DDR,     STPMIC_BUCK6,  BUCK6_MAIN_CR1,  BUCK6_MAIN_CR2,  \
    BUCK6_ALT_CR1,  BUCK6_ALT_CR2,  BUCK6_PWRCTRL_CR,  1200, 1200
  },
  {
    "VREF_DDR",    VREF_DDR,    STPMIC_REFDDR, REFDDR_MAIN_CR,  REFDDR_MAIN_CR,  \
    REFDDR_ALT_CR,  REFDDR_ALT_CR,  REFDDR_PWRCTRL_CR, 0000, 0000
  },
  {
    "VTT_DDR",     VTT_DDR,     STPMIC_LDO3,   LDO3_MAIN_CR,    LDO3_MAIN_CR,    \
    LDO3_ALT_CR,    LDO3_ALT_CR,    LDO3_PWRCTRL_CR,   0000, 0000
  },
  {
    "VPP_DDR",     VPP_DDR,     STPMIC_LDO5,   LDO5_MAIN_CR,    LDO5_MAIN_CR,    \
    LDO5_ALT_CR,    LDO5_ALT_CR,    LDO5_PWRCTRL_CR,   2500, 2500
  },
  {
    "VDD_SDCARD",  VDD_SDCARD,  STPMIC_LDO7,   LDO7_MAIN_CR,    LDO7_MAIN_CR,    \
    LDO7_ALT_CR,    LDO7_ALT_CR,    LDO7_PWRCTRL_CR,   1800, 3300
  },
  {
    "VDDIO_SDCARD", VDDIO_SDCARD, STPMIC_LDO8,   LDO8_MAIN_CR,    LDO8_MAIN_CR,  \
    LDO8_ALT_CR,    LDO8_ALT_CR,    LDO8_PWRCTRL_CR,   3300, 3300
  },
  {
    "V3V3",        V3V3,        STPMIC_BUCK7,  BUCK7_MAIN_CR1,  BUCK7_MAIN_CR2,  \
    BUCK7_ALT_CR1,  BUCK7_ALT_CR2,  BUCK7_PWRCTRL_CR,  3300, 3300
  },
};


/**
  * @}
 */

/** @defgroup STM32MP257F_EVAL_STPMU_Private_Functions Private Functionss
  * @{
  */

/* Private function prototypes -----------------------------------------------*/

STPMIC2_Object_t   STPMIC2Obj = { 0 };
static int32_t STPMIC_Probe();
void STPMIC_Enable_Interrupt(PMIC_IRQn IRQn);
void STPMIC_Disable_Interrupt(PMIC_IRQn IRQn);
void STPMIC_INTn_Callback(PMIC_IRQn IRQn);

/* Private functions ---------------------------------------------------------*/


static int32_t STPMIC_Probe()
{
  int32_t ret = STPMIC2_OK;
  STPMIC2_IO_t              IOCtx;
  uint8_t                  id;

  /* Only perform the init if the object already exist */
  if (!CompObj)
  {
    /* Configure the I2C driver */
    IOCtx.Address     = STPMIC_I2C_ADDRESS;
    IOCtx.Init        = BSP_I2C_Init;
    IOCtx.DeInit      = BSP_I2C_DeInit;
    IOCtx.ReadReg     = BSP_I2C_ReadReg;
    IOCtx.WriteReg    = BSP_I2C_WriteReg;
    IOCtx.GetTick     = BSP_GetTick;

    ret = STPMIC2_RegisterBusIO(&STPMIC2Obj, &IOCtx);
    if (ret != STPMIC2_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    ret = STPMIC2_ReadID(&STPMIC2Obj, &id);
    if (ret != STPMIC2_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    if ((id & 0xF0) != STPMIC2_ID)
    {
      return BSP_ERROR_UNKNOWN_COMPONENT;
    }

    Stpmic2Drv = (STPMIC2_Drv_t *) &STPMIC2_Driver;
    CompObj = &STPMIC2Obj;
  }

  ret = Stpmic2Drv->Init(CompObj);
  if (ret != STPMIC2_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_Init(void)
{
  int32_t status = BSP_ERROR_NONE;

  status = STPMIC_Probe();
  if (status != BSP_ERROR_NONE)
  {
    return status;
  }

#ifdef USE_WAKEUP_PIN

#else
  GPIO_InitTypeDef  GPIO_InitStruct;

  if (ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(90)) == RESMGR_STATUS_ACCESS_OK)
  {
    /* INTn - Interrupt Line - Active Low (Falling Edge) */
    PMIC_INTN_CLK_ENABLE();
  }
  /* Acquire GPIOA0 using Resource manager */
  if (RESMGR_STATUS_ACCESS_OK != ResMgr_Request(RESMGR_RESOURCE_RIF_GPIOA, RESMGR_GPIO_PIN(0)))
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  GPIO_InitStruct.Pin       = PMIC_INTN_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull      = GPIO_PULLUP; /* GPIO_NOPULL */
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = 0 ;
  HAL_GPIO_Init(PMIC_INTN_PORT, &GPIO_InitStruct);

  /* Enable and set INTn EXTI Interrupt  */
#if defined (CORE_CM33) || defined (CORE_CM0PLUS)
  HAL_NVIC_SetPriority(PMIC_INTN_EXTI_IRQ, 0, 0);
  HAL_NVIC_EnableIRQ(PMIC_INTN_EXTI_IRQ);
#endif /* defined (CORE_CM33) || defined (CORE_CM0PLUS) */
#endif /* USE_WAKEUP_PIN */

