STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_pmic.c
  STPMIC_Enable_Interrupt(STPMIC2_IT_PONKEY_F);
  STPMIC_Enable_Interrupt(STPMIC2_IT_PONKEY_R);

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_DeInit(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  status = Stpmic2Drv->DeInit(CompObj);
  if (status != STPMIC2_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  if (RESMGR_STATUS_ACCESS_OK != ResMgr_Release(RESMGR_RESOURCE_RIF_GPIOA, RESMGR_GPIO_PIN(0)))
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }
  return status;
}

uint32_t BSP_PMIC_ReadReg(uint8_t reg, uint8_t *pdata)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2Drv->ReadReg(CompObj, reg, pdata);
  if (status != STPMIC2_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

uint32_t BSP_PMIC_WriteReg(uint8_t reg, uint8_t data)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2Drv->WriteReg(CompObj, reg, data);
  if (status != STPMIC2_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

uint32_t BSP_PMIC_UpdateReg(uint8_t reg, uint8_t mask)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2Drv->UpdateReg(CompObj, reg, mask);
  if (status != STPMIC2_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

#if defined (STPMIC2_DEBUG)
/*
 *
 * PMIC registers dump
 *
 */
/* following are configurations */
uint32_t BSP_PMIC_DumpRegs(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  status = Stpmic2Drv->DumpRegs(CompObj);
  if (status != STPMIC2_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return status;
}
#endif /* defined (STPMIC2_DEBUG) */

#ifdef __AARCH64__
static void bsp_pmic_delay_us(uint64_t delay_us)
{
  __IO uint64_t wait_loop_index = 0U;

  wait_loop_index = delay_us * (SystemCoreClock / (1000000UL * 2UL));

  while(wait_loop_index != 0UL)
  {
    wait_loop_index--;
  }
}
#endif /* __AARCH64__ */

/*
 *
 * @brief BSP_PMIC_DDR_Power_Init initialize DDR power
 *
 * DDR power on sequence is:
 * enable VPP_DDR
 * wait 2ms
 * enable VREF_DDR, VTT_DDR, VPP_DDR
 *
 * @param  None
 * @retval status
 *
 */
/* following are configurations */
uint32_t BSP_PMIC_DDR_Power_Init()
{
  uint32_t  status = BSP_ERROR_NONE;

  /* vpp_ddr ==> LDO5 ==> 2500mV */
  if (BSP_PMIC_WriteReg(board_regulators_table[VPP_DDR].control_reg1, 0x1E) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  /* vdd_ddr ==> BUCK6 ==> 1200mV */
  if (BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg1, 0x46) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  /* vtt_ddr ==> enable flag SINK_SOURCE ==> LDO3 ==> 900mV */
  if (BSP_PMIC_UpdateReg(board_regulators_table[VTT_DDR].control_reg1, 0x80) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  /* enable vpp_ddr */
  if (BSP_PMIC_UpdateReg(board_regulators_table[VPP_DDR].control_reg1, 0x1) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

#ifdef __AARCH64__
  bsp_pmic_delay_us(2UL);
#else /* __AARCH64__ */
  HAL_Delay(2);
#endif /* __AARCH64__ */

  /* enable vdd_ddr */
  if (BSP_PMIC_UpdateReg(board_regulators_table[VDD_DDR].control_reg2, 0x1 != BSP_ERROR_NONE))
  {
    return BSP_ERROR_PMIC;
  }

  /* enable vref_ddr */
  if (BSP_PMIC_UpdateReg(board_regulators_table[VREF_DDR].control_reg1, 0x1 != BSP_ERROR_NONE))
  {
    return BSP_ERROR_PMIC;
  }

  /* enable vtt_ddr */
  if (BSP_PMIC_UpdateReg(board_regulators_table[VTT_DDR].control_reg1, 0x1) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  return status;
}

uint32_t BSP_PMIC_REGU_Set_On(board_regul_t regu)
{
  uint32_t  status = BSP_ERROR_NONE;
  uint8_t data;

  switch (regu)
  {
    case VDDA1V8_AON:
    case VDD_EMMC:
    case VTT_DDR:
    case VDD3V3_USB:
    case VPP_DDR:
    case VDD_SDCARD:
    case VDDIO_SDCARD:
    case VREF_DDR:
      /* set enable bit */
      if (BSP_PMIC_UpdateReg(board_regulators_table[regu].control_reg1, MAIN_CR_EN) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_PMIC;
      }
      break;
    case VDDCPU:
    case VDDCORE:
    case VDDGPU:
    case VDDIO_PMIC:
    case V1V8:
    case VDD_DDR:
    case V3V3:
      /* Forbid VDDGPU to be set on if VDDCORE is not enabled */
      if (regu == VDDGPU)
      {
        if (BSP_PMIC_ReadReg(board_regulators_table[VDDCORE].control_reg2, &data) != \
            BSP_ERROR_NONE) /* read control reg */
        {
          return BSP_ERROR_PMIC;
        }

        if ((data & MAIN_CR_EN) != MAIN_CR_EN)
        {
          return BSP_ERROR_PMIC;
        }
      }
      /* set enable bit */
      if (BSP_PMIC_UpdateReg(board_regulators_table[regu].control_reg2, MAIN_CR_EN) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_PMIC;
      }
      break;
    default:
      status = BSP_ERROR_WRONG_PARAM ;
      break;
  }

  return status;
}

uint32_t BSP_PMIC_REGU_Set_Off(board_regul_t regu)
{
  uint32_t  status = BSP_ERROR_NONE;
  uint8_t data;

  switch (regu)
  {
    case VDDA1V8_AON:
    case VDD_EMMC:
    case VTT_DDR:
    case VDD3V3_USB:
    case VPP_DDR:
    case VDD_SDCARD:
    case VDDIO_SDCARD:
    case VREF_DDR:
      /* disable ==> clear enable bit */
      if (BSP_PMIC_ReadReg(board_regulators_table[regu].control_reg1,
                           &data) != BSP_ERROR_NONE) /* read control reg to save data */
      {
        return BSP_ERROR_PMIC;
      }

      data &= ~MAIN_CR_EN; /* clear enable bit */
      if (BSP_PMIC_WriteReg(board_regulators_table[regu].control_reg1,
                            data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
      {
        return BSP_ERROR_PMIC;
      }
      break;
    case VDDCPU:
    case VDDCORE:
    case VDDGPU:
    case VDDIO_PMIC:
    case V1V8:
    case VDD_DDR:
    case V3V3:
      /* disable ==> clear enable bit */
      if (BSP_PMIC_ReadReg(board_regulators_table[regu].control_reg2,
                           &data) != BSP_ERROR_NONE) /* read control reg to save data */
      {
        return BSP_ERROR_PMIC;
      }

      data &= ~MAIN_CR_EN; /* clear enable bit */
      if (BSP_PMIC_WriteReg(board_regulators_table[regu].control_reg2,
                            data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
      {
        return BSP_ERROR_PMIC;
      }
      break;
    default:
      status = BSP_ERROR_WRONG_PARAM ;
      break;
  }

