STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_pmic.c
  return status;
}

uint32_t BSP_PMIC_DDR_Power_Off()
{
  uint32_t  status = BSP_ERROR_NONE;
  uint8_t data;

  /* disable vpp_ddr */
  if (BSP_PMIC_ReadReg(board_regulators_table[VPP_DDR].control_reg1,
                       &data) != BSP_ERROR_NONE) /* read control reg to save data */
  {
    return BSP_ERROR_PMIC;
  }

  data &= ~MAIN_CR_EN; /* clear enable bit */
  if (BSP_PMIC_WriteReg(board_regulators_table[VPP_DDR].control_reg1,
                        data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
  {
    return BSP_ERROR_PMIC;
  }

  HAL_Delay(2);

  /* disable vdd_ddr */
  if (BSP_PMIC_ReadReg(board_regulators_table[VDD_DDR].control_reg2,
                       &data) != BSP_ERROR_NONE) /* read control reg to save data */
  {
    return BSP_ERROR_PMIC;
  }

  data &= ~MAIN_CR_EN; /* clear enable bit */
  if (BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg2,
                        data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
  {
    return BSP_ERROR_PMIC;
  }

  /* disable vref_ddr */
  if (BSP_PMIC_ReadReg(board_regulators_table[VREF_DDR].control_reg1,
                       &data) != BSP_ERROR_NONE) /* read control reg to save data */
  {
    return BSP_ERROR_PMIC;
  }

  data &= ~MAIN_CR_EN; /* clear enable bit */
  if (BSP_PMIC_WriteReg(board_regulators_table[VREF_DDR].control_reg1,
                        data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
  {
    return BSP_ERROR_PMIC;
  }

  /* disable vtt_ddr */
  if (BSP_PMIC_ReadReg(board_regulators_table[VTT_DDR].control_reg1,
                       &data) != BSP_ERROR_NONE) /* read control reg to save data */
  {
    return BSP_ERROR_PMIC;
  }

  data &= ~MAIN_CR_EN; /* clear enable bit */
  if (BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].control_reg1,
                        data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
  {
    return BSP_ERROR_PMIC;
  }

  return status;
}

/**
  * @brief  BSP_PMIC_Set_Power_Mode Set PMIC run/low power mode
  * @param  mode  mode to set
  * @retval status
  */
/**
  * MPU control signals PWRCTRL-connexion   RUN1 / STOP1  RUN2 / STOP2  LPLV-STOP1  LPLV-STOP2  STANDBY (DDR SR)  STANDBY (DDR OFF)
  * NRST                    1       1       1     1     1         1
  * PWR_ONLP      PWRCTRL1        1       1       0     0     0         0
  * PWR_CPU_ON      PWRCTRL2        1       0       1     0     0         0
  * NRSTC1MS      PWRCTRL3        1       0       1     0     0         0
  *
  *                           PWRCTRL                                                       RUN1 / STOP1      RUN2 /STOP2       LPLV-STOP1      LPLV-STOP2      STANDBY (DDR SR)  STANDBY (DDR OFF)
  * Name on schematic device tree   STPMIC25 name PWRCTRLx_SEL  PWRCTRLx_DLY_H  PWRCTRLx_DLY_L  PWRCTRLx_EN PWRCTRLx_RST  Pull Down Mask_Reset  FS_OCP  Source  Vrun1 / stop1 State Vrun2 / stop2 State Vlplv-stop1 State Vlplv-stop2 State Vstanby State   Vstanby State
  * VDDA1V8_AON     Vdda1V8_aon   ldo1      0       0       0       0     0             1     1   VOUT4 NA        ON    NA        ON    NA      ON    NA      ON    NA    ON      NA    ON
  * VDD_EMMC      Vdd_emmc    ldo2      3       0       0       0     1                       NA    3,3       ON    NA        OFF   3,3     ON    NA      OFF   NA    OFF     NA    OFF
  * VTT_DDR       vtt_ddr     ldo3      1       0       0       1     0                   1   NA    SINK-SOURCE   ON    SINK-SOURCE   ON    NA      OFF   NA      OFF   NA    OFF     NA    OFF
  * VDD3V3_USB      Vdd3v3_usb    ldo4      0       0       0       0     0                       NA    NA        ON    NA        ON    NA      ON    NA      OFF ? NA    OFF     NA    OFF
  * VPP_DDR       vpp_ddr     ldo5      1       0       0       1     0                   1   NA    2,5       ON    2,5       ON    2,5     ON    2,5     ON    2,5   ON      NA    OFF
  * VDD_SDCARD      Vdd_sdcard    ldo7      3       0       0       0     1                       NA    BYPASS      ON    NA        OFF   BYPASS    ON    NA      OFF   NA    OFF     NA    OFF
  * VDDIO_SDCARD    vddio_sdcard  ldo8      3       0       0       0     1                       NA    BYPASS/1,8V   ON    NA        OFF   BYPASS/1,8V ON    NA      OFF   NA    OFF     NA    OFF
  * VREFDDR       vref_ddr    REFDDR      1       0       0       1     0                   1   NA    NA        ON    NA        ON    NA      ON    NA      ON    NA    ON      NA    OFF
  * VDDCPU        Vddcpu      buck1     2       0       0       1     0                   1   NA    0,8 / 0,91    ON_HP NA        OFF   0,8 / 0,91  ON_HP NA      OFF   NA    OFF     NA    OFF
  * VDDCORE       Vddcore     buck2     1       0       0       1     0                   1   NA    0,82      ON_HP 0,82      ON_HP 0,67    ON_HP 0,67    ON_HP NA    OFF     NA    OFF
  * VDDGPU        Vddgpu      buck3     0       0       0       0     0                       NA    0,8 / 0,9   ON_HP NA        OFF   NA      OFF   NA      OFF   NA    OFF     NA    OFF
  * VDDIO       Vdd       buck4     0       0       0       0     0             1     1   NA    3,3       ON_HP 3,3       ON_HP 3,3     ON_HP 3,3     ON_HP 3,3   ON_LP   3,3   ON_LP
  * 1V8         Vdda1V8     buck5     1       0       0       1     0                   1   NA    1,8       ON_HP 1,8       ON_HP 1,8     ON_HP 1,8     ON_HP NA    OFF     NA    OFF
  * VDD_DDR       Vdd_ddr     buck6     1       0       0       1     0       fast          1   NA    1,2       ON_HP 1,2       ON_HP 1,2     ON_HP 1,2     ON_HP 1,2   ON_LP   NA    OFF
  * 3V3         3v3       buck7     1       0       0       1     0                       NA    3,3       ON_HP 3,3       ON_HP 3,3     ON_HP 3,3     ON_HP NA    OFF     NA    OFF
  *
  * PMIC state machine state:     RUN   RUN   RUN   RUN   RUN   STANDBY
  * STANDBY_PWRCTRL_SEL[1:0]      0   0   0   0   0   1
  * PMIC static configuration
  *
  * PWRCTRL1_POL  0
  * PWRCTRL2_POL  0
  * PWRCTRL3_POL  0
  * WDG_PWRCTRL_SEL[1:0]  1
  *
  */
uint32_t BSP_PMIC_Power_Mode_Init()
{
  uint32_t  status = BSP_ERROR_NONE;

  /* Fail-safe overcurrent protection */
  status = BSP_PMIC_WriteReg(FS_OCP_CR1, FS_OCP_REFDDR | FS_OCP_BUCK6 | FS_OCP_BUCK5 \
                             | FS_OCP_BUCK4 | FS_OCP_BUCK2 | FS_OCP_BUCK1);
  status = BSP_PMIC_WriteReg(FS_OCP_CR2, FS_OCP_LDO5 | FS_OCP_LDO3 | FS_OCP_LDO1);

  /* Mask reset LDO control register (LDOS_MRST_CR) for VDDA1V8_AON (LDO1) */
  status = BSP_PMIC_WriteReg(LDOS_MRST_CR, LDO1_MRST);

  /* Mask reset BUCK control register (BUCKS_MRST_CR) for VDDIO (BUCK4) */
  status = BSP_PMIC_WriteReg(BUCKS_MRST_CR, BUCK4_MRST);

  /* for VBAT issue */
  /* Mask reset BUCK control register (BUCKS_MRST_CR) for VDDCPU (BUCK1), VDDCORE (BUCK2), VDDIO (BUCK4) */
  status = BSP_PMIC_WriteReg(BUCKS_MRST_CR, BUCK1_MRST | BUCK2_MRST | BUCK4_MRST);

