STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_pmic.c
  /* VDDA1V8_AON: LDO1, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=1, Source=VOUT4, V=N/A, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDA1V8_AON].control_reg1, \
                             MAIN_CR_INPUT_SRC_VOUT4 | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDA1V8_AON].pwr_control_reg, \
                             PWRCTRL_CR_SEL0 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0);
  /* VDD_EMMC: LDO2, PWRCTRL_SEL=3, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=1, Msk_Rst=0, Source=NA, V=3.3, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_EMMC].control_reg1, \
                             (0x18 << 1) | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_EMMC].pwr_control_reg, \
                             PWRCTRL_CR_SEL3 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_RST);
  /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=SINK_SOURCE, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].control_reg1, \
                             MAIN_CR_SNK_SRC | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);
  /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1, \
                             MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].pwr_control_reg, 0x0);
  /* VPP_DDR: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=2.5, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VPP_DDR].control_reg1, \
                             (0x10 << 1) | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VPP_DDR].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);
  /* VDD_SDCARD: LDO7, PWRCTRL_SEL=3, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=1, Msk_Rst=0, Source=NA, V=BYPASS, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SDCARD].control_reg1, \
                             MAIN_CR_BYPASS | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SDCARD].pwr_control_reg, \
                             PWRCTRL_CR_SEL3 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_RST);
  /* VDDIO_SDCARD: LDO8, PWRCTRL_SEL=3, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=1, Msk_Rst=0, Source=NA, V=BYPASS/1.8, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_SDCARD].control_reg1, \
                             (0x9 << 1) | MAIN_CR_BYPASS | MAIN_CR_EN); /* TBC mode bypass or not????? */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_SDCARD].pwr_control_reg, \
                             PWRCTRL_CR_SEL3 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_RST);
  /* VREF_DDR: REFDDR, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VREF_DDR].control_reg1, \
                             MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VREF_DDR].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);
  /* VDDCPU: BUCK1, PWRCTRL_SEL=2, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.8/0.91, State=ON_HP */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].control_reg1, 0x1E); /* 0x1E ==> V=0.8V, 0x29 ==> V=0.91 */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].control_reg2, \
                             MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
  /* Add for multiple standby issue */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].pwr_control_reg, \
                             PWRCTRL_CR_SEL2 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);
  /* VDDCORE: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.82, State=ON_HP */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].control_reg1, 0x20);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].control_reg2, \
                             MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);
  /* VDDGPU: BUCK3, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.8/0.9, State=ON_HP */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDGPU].control_reg1, 0x1E); /* 0x1E ==> V=0.8V, 0x28 ==> V=0.9 */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDGPU].control_reg2, \
                             MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDGPU].pwr_control_reg, \
                             PWRCTRL_CR_SEL0 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0);
  /* VDDIO: BUCK4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON_HP */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].control_reg1, 0x76);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].control_reg2, \
                             MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].pwr_control_reg, \
                             PWRCTRL_CR_SEL0 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0);
  /* V1V8: BUCK5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.8, State=ON_HP */
  status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].control_reg1, 0x67);
  status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].control_reg2, \
                             MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);
  /* VDD_DDR: BUCK6, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.2, State=ON_HP */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg1, 0x46);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg2, \
                             MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);
  /* V3V3: BUCK7, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=3.3, State=ON_HP */
  status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].control_reg1, 0x76);
  status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].control_reg2, \
                             MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

