STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_pmic.c
  return status;
}

uint32_t BSP_PMIC_Set_Power_Mode(uint32_t mode)
{
  uint32_t  status = BSP_ERROR_NONE;
  uint8_t data;

  switch (mode)
  {
    case STPMIC2_RUN1_STOP1:
      /* VDD_EMMC: LDO2, PWRCTRL_SEL=3, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
      PWRCTRL_RST=1, Msk_Rst=0, Source=NA, V=3.3, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_EMMC].control_reg1, \
                                 (0x18 << 1) | MAIN_CR_EN);
      /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=SINK_SOURCE, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].control_reg1, \
                                 MAIN_CR_SNK_SRC | MAIN_CR_EN);
      /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1, \
                                 MAIN_CR_EN);
      /* VPP_DDR: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=2.5, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VPP_DDR].control_reg1, \
                                 (0x10 << 1) | MAIN_CR_EN);
      /* VDD_SDCARD: LDO7, PWRCTRL_SEL=3, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
      PWRCTRL_RST=1, Msk_Rst=0, Source=NA, V=BYPASS, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SDCARD].control_reg1, \
                                 MAIN_CR_BYPASS | MAIN_CR_EN);
      /* VDDIO_SDCARD: LDO8, PWRCTRL_SEL=3, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
      PWRCTRL_RST=1, Msk_Rst=0, Source=NA, V=BYPASS/1.8, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_SDCARD].control_reg1, \
                                 (0x9 << 1) | MAIN_CR_BYPASS | MAIN_CR_EN); /* TBC mode bypass or not????? */
      /* VREF_DDR: REFDDR, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VREF_DDR].control_reg1, \
                                 MAIN_CR_EN);
      /* VDDCPU: BUCK1, PWRCTRL_SEL=2, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.8/0.91, State=ON_HP */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].control_reg1, \
                                 0x1E); /* 0x1E ==> V=0.8V, 0x29 ==> V=0.91 */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].control_reg2, \
                                 MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
      /* VDDCORE: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.82, State=ON_HP */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].control_reg1, \
                                 0x20);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].control_reg2, \
                                 MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
      /* VDDGPU: BUCK3, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.8/0.9, State=ON_HP */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDGPU].control_reg1, \
                                 0x1E); /* 0x1E ==> V=0.8V, 0x28 ==> V=0.9 */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDGPU].control_reg2, \
                                 MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
      /* VDDIO: BUCK4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
      PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON_HP */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].control_reg1, \
                                 0x76);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].control_reg2, \
                                 MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
      /* V1V8: BUCK5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.8, State=ON_HP */
      status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].control_reg1, \
                                 0x67);
      status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].control_reg2, \
                                 MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
      /* VDD_DDR: BUCK6, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.2, State=ON_HP */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg1, \
                                 0x46);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].control_reg2, \
                                 MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
      /* V3V3: BUCK7, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=3.3, State=ON_HP */
      status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].control_reg1, \
                                 0x76);
      status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].control_reg2, \
                                 MAIN_CR_PREG_MODE0 | MAIN_CR_EN);
      /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
      status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
      data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
      status = BSP_PMIC_WriteReg(MAIN_CR, data); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 0 */
      break;

    case STPMIC2_RUN2_STOP2:
      /* VDDCPU: BUCK1, PWRCTRL_SEL=2, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg2, 0x0);
      /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
      status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
      data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
      status = BSP_PMIC_WriteReg(MAIN_CR, data); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 0 */
      break;

