STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_pmic.c
    case STPMIC2_STANDBY_DDR_SR:
      /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].alt_control_reg1, 0x0);
      /* VPP_DDR: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=2.5, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VPP_DDR].alt_control_reg1, \
                                 (0x10 << 1) | MAIN_CR_EN);
      /* VREF_DDR: REFDDR, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
      status = BSP_PMIC_WriteReg(board_regulators_table[VREF_DDR].alt_control_reg1, MAIN_CR_EN);
      status = BSP_PMIC_WriteReg(board_regulators_table[VREF_DDR].alt_control_reg2, 0x0);
      /* VDDCPU: BUCK1, PWRCTRL_SEL=2, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg2, 0x0);
      /* VDDCORE: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg2, 0x0);
      /* VDDIO: BUCK4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
         PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON_LP */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].alt_control_reg1, 0x76);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].alt_control_reg2, \
                                 MAIN_CR_PREG_MODE1 | MAIN_CR_EN);
      /* V1V8: BUCK5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].alt_control_reg2, 0x0);
      /* VDD_DDR: BUCK6, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.2, State=ON_LP */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg1, 0x46);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg2, \
                                 MAIN_CR_PREG_MODE1 | MAIN_CR_EN);
      /* V3V3: BUCK7, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].alt_control_reg2, 0x0);

      /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
      status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
      data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
      status = BSP_PMIC_WriteReg(MAIN_CR, data); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 0 */
      break;

    case STPMIC2_STANDBY_DDR_OFF:
      /* VTT_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VTT_DDR].alt_control_reg1, 0x0);
      /* VPP_DDR: LDO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VPP_DDR].alt_control_reg1, 0x0);
      /* VREF_DDR: REFDDR, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VREF_DDR].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[VREF_DDR].alt_control_reg2, 0x0);
      /* VDDCPU: BUCK1, PWRCTRL_SEL=2, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg2, 0x0);
      /* VDDCORE: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg2, 0x0);
      /* VDDIO: BUCK4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
         PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON_LP */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].alt_control_reg1, 0x76);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO_PMIC].alt_control_reg2, \
                                 MAIN_CR_PREG_MODE1 | MAIN_CR_EN);
      /* V1V8: BUCK5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
      PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[V1V8].alt_control_reg2, 0x0);
      /* VDD_DDR: BUCK6, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=BNA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[VDD_DDR].alt_control_reg2, 0x0);
      /* V3V3: BUCK7, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
         PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
      status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].alt_control_reg1, 0x0);
      status = BSP_PMIC_WriteReg(board_regulators_table[V3V3].alt_control_reg2, 0x0);
      /* STANDBY_PWRCTRL_SEL[1:0] = 1 */
      status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
      data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
      status = BSP_PMIC_WriteReg(MAIN_CR, data | \
                                 STANDBY_PWRCTRL_SEL_1); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 1 */
      break;

    default :
      status = BSP_ERROR_WRONG_PARAM;
  }

