STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_pmic.c
  return status;
}

void STPMIC_Enable_Interrupt(PMIC_IRQn IRQn)
{
  uint8_t irq_reg;
  uint8_t irq_reg_value;
  uint8_t mask ;

  if (IRQn >= IRQ_NR)
  {
    return ;
  }

  /* IRQ register is IRQ Number divided by 8 */
  irq_reg = IRQn >> 3 ;

  /* value to be set in IRQ register corresponds to BIT(N) where N is the Interrupt id modulo 8 */
  irq_reg_value = 1 << (IRQn % 8);

  /* Get active mask from register */
  BSP_PMIC_ReadReg(INT_MASK_R1 + irq_reg, &mask);
  mask &=  ~irq_reg_value ;
  /* Clear relevant mask to enable interrupt */
  BSP_PMIC_WriteReg(INT_MASK_R1 + irq_reg, mask);

}

void STPMIC_Disable_Interrupt(PMIC_IRQn IRQn)
{
  uint8_t irq_reg;
  uint8_t irq_reg_value;
  uint8_t mask ;

  if (IRQn >= IRQ_NR)
  {
    return ;
  }

  /* IRQ register is IRQ Number divided by 8 */
  irq_reg = IRQn >> 3 ;

  /* value to be set in IRQ register corresponds to BIT(N) where N is the Interrupt id modulo 8 */
  irq_reg_value = 1 << (IRQn % 8);

  /* Get active mask from register */
  BSP_PMIC_ReadReg(INT_MASK_R1 + irq_reg, &mask);
  mask |=  irq_reg_value ;
  /* Set relevant mask to disable interrupt */
  BSP_PMIC_WriteReg(INT_MASK_R1 + irq_reg, mask);

}


void STPMIC_IrqHandler(void)
{
  uint8_t irq_reg;
  uint8_t mask;
  uint8_t pending_events;
  uint8_t i;

  for (irq_reg = 0 ; irq_reg < STM32_PMIC_NUM_IRQ_REGS ; irq_reg++)
  {
    /* Get pending events & active mask */
    BSP_PMIC_ReadReg(INT_MASK_R1 + irq_reg, &mask);
    BSP_PMIC_ReadReg(INT_PENDING_R1 + irq_reg, &pending_events);
    pending_events &=  ~mask ;

    /* Go through all bits for each register */
    for (i = 0 ; i < 8 ; i++)
    {
      if (pending_events & (1 << i))
      {
        /* Callback with parameter computes as "PMIC Interrupt" enum */
        STPMIC_INTn_Callback((PMIC_IRQn)(irq_reg * 8 + (7 - i)));
      }
    }
    /* Clear events in appropriate register for the event with mask set */
    BSP_PMIC_WriteReg(INT_CLEAR_R1 + irq_reg, pending_events);
  }

}

void STPMIC_Sw_Reset(void)
{
  /* Write 1 in bit 0 of MAIN_CONTROL Register */
  BSP_PMIC_UpdateReg(MAIN_CR, SOFTWARE_SWITCH_OFF_ENABLED);
  return ;
}


__weak void BSP_PMIC_INTn_Callback(PMIC_IRQn IRQn)
{
  switch (IRQn)
  {
    case STPMIC2_IT_PONKEY_F:
      printf("STPMIC2_IT_PONKEY_F");
      break;
    case STPMIC2_IT_PONKEY_R:
      printf("STPMIC2_IT_PONKEY_R");
      break;
    case STPMIC2_IT_WKP_FA:
      printf("STPMIC2_IT_WKP_FA");
      break;
    case STPMIC2_IT_WKP_RI:
      printf("STPMIC2_IT_WKP_RI");
      break;
    case STPMIC2_IT_VINLOW_FA:
      printf("STPMIC2_IT_VINLOW_FA");
      break;
    case STPMIC2_IT_VINLOW_RI:
      printf("STPMIC2_IT_VINLOW_RI");
      break;
    case STPMIC2_IT_VBUS_FA:
      printf("STPMIC2_IT_VBUS_FA");
      break;
    case STPMIC2_IT_VBUS_RI:
      printf("STPMIC2_IT_VBUS_RI");
      break;
    case STPMIC2_IT_THW_FA:
      printf("STPMIC2_IT_THW_FA");
      break;
    case STPMIC2_IT_THW_RI:
      printf("STPMIC2_IT_THW_RI");
      break;
    case STPMIC2_IT_BUCK1_OCP:
      printf("STPMIC2_IT_BUCK1_OCP");
      break;
    case STPMIC2_IT_BUCK2_OCP:
      printf("STPMIC2_IT_BUCK2_OCP");
      break;
    case STPMIC2_IT_BUCK3_OCP:
      printf("STPMIC2_IT_BUCK3_OCP");
      break;
    case STPMIC2_IT_BUCK4_OCP:
      printf("STPMIC2_IT_BUCK4_OCP");
      break;
    case STPMIC2_IT_BUCK5_OCP:
      printf("STPMIC2_IT_BUCK5_OCP");
      break;
    case STPMIC2_IT_BUCK6_OCP:
      printf("STPMIC2_IT_BUCK6_OCP");
      break;
    case STPMIC2_IT_BUCK7_OCP:
      printf("STPMIC2_IT_BUCK7_OCP");
      break;
    case STPMIC2_IT_REFDDR_OCP:
      printf("STPMIC2_IT_REFDDR_OCP");
      break;
    case STPMIC2_IT_LDO1_OCP:
      printf("STPMIC2_IT_LDO1_OCP");
      break;
    case STPMIC2_IT_LDO2_OCP:
      printf("STPMIC2_IT_LDO2_OCP");
      break;
    case STPMIC2_IT_LDO3_OCP:
      printf("STPMIC2_IT_LDO3_OCP");
      break;
    case STPMIC2_IT_LDO4_OCP:
      printf("STPMIC2_IT_LDO4_OCP");
      break;
    case STPMIC2_IT_LDO5_OCP:
      printf("STPMIC2_IT_LDO5_OCP");
      break;
    case STPMIC2_IT_LDO6_OCP:
      printf("STPMIC2_IT_LDO6_OCP");
      break;
    case STPMIC2_IT_LDO7_OCP:
      printf("STPMIC2_IT_LDO7_OCP");
      break;
    case STPMIC2_IT_LDO8_OCP:
      printf("STPMIC2_IT_LDO8_OCP");
      break;
    default:
      printf("Unknown IRQ %d", IRQn);
      break;
  }
  printf(" Interrupt received\n\r");
}

void STPMIC_INTn_Callback(PMIC_IRQn IRQn)
{
  BSP_PMIC_INTn_Callback(IRQn);
};
#if 0 /* SBA test */
void BSP_PMIC_INTn_IRQHandler(void)
{
  /*printf("%s:%d\n\r", __FUNCTION__, __LINE__);*/
  /* Call HAL EXTI IRQ Handler to clear appropriate flags */
  HAL_GPIO_EXTI_IRQHandler(PMIC_INTN_PIN);

  STPMIC_IrqHandler();
}
#endif /* 0 */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
